OFtutorial12_momentumSource/testCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    side0
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          1200;
        startFace       69200;
    }
    side1
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          1200;
        startFace       70400;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       71600;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       72000;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          1200;
        startFace       72400;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          1200;
        startFace       73600;
    }
)

// ************************************************************************* //
